<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b3ee65e69ce4e7b3c17aaf75d23b665e1a6804f01d6e608c9be35128b5b4f38c","plan_job_ref":"Job Plan Airflow DAGs #363 at https://github.com/cal-itp/data-infra/actions/runs/16430288791","plan_out_hash":"be7e2f5f156c9ccd3f2bc0100be563c2b4eb283461db979201b0988b71e55b58","plan_hash":"be4113ae28a86b90e1b9b3323d63dced8aa99a3ad533546d466988ecbe550673","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "uJ8Z3Q==" -> (known after apply)
!~      detect_md5hash      = "mDS0QrnOpntb04R+HA9/pA==" -> "different hash"
!~      generation          = 1752629644990909 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_all_dag.py"
!~      md5hash             = "mDS0QrnOpntb04R+HA9/pA==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_manual_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/dbt_manual_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/dbt_manual_dag.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ZMF1FA==" -> (known after apply)
!~      detect_md5hash      = "ZldhX3X7D8ySchcrTwyvPg==" -> "different hash"
!~      generation          = 1752889500989811 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "ZldhX3X7D8ySchcrTwyvPg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "6syT5w==" -> (known after apply)
!~      detect_md5hash      = "BlyAtyF0Q2vlG9FBl97YlQ==" -> "different hash"
!~      generation          = 1752889502782453 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "BlyAtyF0Q2vlG9FBl97YlQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #363](https://github.com/cal-itp/data-infra/actions/runs/16430288791)